Just wanted to follow and confirm that I've successfully tested the HCP Packer image with terraform.

My configs are as follows (ocids are redacted):

```hcl
source "oracle-oci" "test" {
  availability_domain = "XXX:AP-MELBOURNE-1-AD-1"
  base_image_ocid     = "ocid1.image.oc1.ap-melbourne-1.aaaaaaaavfq26hqjuuphwtnggw624y3j7fwk33fryvmn4ttb2jk4e7idewfa"
  compartment_ocid    = "ocid1.compartment.oc1..aaaaaaaa"
  image_name          = "tf-oci-test"
  shape               = "VM.Standard.E2.1.Micro"
  ssh_username        = "ubuntu"
  subnet_ocid         = "ocid1.subnet.oc1.ap-melbourne-1.aaaaaaaa"
}

build {
  hcp_packer_registry {
    bucket_name = "tf-oci-test"
    description = "description"
    bucket_labels = {
      "owner"          = "platform-team"
      "os"             = "Ubuntu",
    }

    build_labels = {
      "build-time"   = timestamp()
      "build-source" = basename(path.cwd)
    }
  }

  sources = ["source.oracle-oci.test"]
}
```
Build:
```
$ packer build image.pkr.hcl
oracle-oci.test: output will be in this color.

==> oracle-oci.test: Creating temporary ssh key for instance...
==> oracle-oci.test: Creating instance...
==> oracle-oci.test: Created instance (ocid1.instance.oc1.ap-melbourne-1.a).
==> oracle-oci.test: Waiting for instance to enter 'RUNNING' state...
==> oracle-oci.test: Instance 'RUNNING'.
==> oracle-oci.test: Instance has IP: 152.69.186.39.
==> oracle-oci.test: Using SSH communicator to connect: 152.69.186.39
==> oracle-oci.test: Waiting for SSH to become available...
==> oracle-oci.test: Connected to SSH!
==> oracle-oci.test: Creating image from instance...
==> oracle-oci.test: Updating image schema...
==> oracle-oci.test: Created image (ocid1.image.oc1.ap-melbourne-1.aaaaaaaa).
==> oracle-oci.test: Terminating instance (ocid1.instance.oc1.ap-melbourne-1.a)...
==> oracle-oci.test: Terminated instance.
Build 'oracle-oci.test' finished after 4 minutes 49 seconds.

==> Wait completed after 4 minutes 49 seconds

==> Builds finished. The artifacts of successful builds are:
--> oracle-oci.test: An image was created: 'tf-oci-test' (OCID: ocid1.image.oc1.ap-melbourne-1.a) in region 'ap-melbourne-1'
--> oracle-oci.test: Published metadata to HCP Packer registry packer/tf-oci-test/iterations/XXX
```
Terraform config:
```hcl
terraform {
  required_providers {
    oci = {
      source  = "oracle/oci"
      version = "~> 4.103"
    }
    hcp = {
      source  = "hashicorp/hcp"
      version = "~> 0.52.0"
    }
  }
}

data "hcp_packer_image" "tf-oci-test" {
  bucket_name    = "tf-oci-test"
  cloud_provider = "packer.oracle.oci"
  channel        = "production"
  region         = "ap-melbourne-1"
}

resource "oci_core_instance" "test_instance" {
  availability_domain = "XXX:AP-MELBOURNE-1-AD-1"
  compartment_id = "ocid1.compartment.oc1..a"
  shape = "VM.Standard.E2.1.Micro"

  create_vnic_details {
    subnet_id = "ocid1.subnet.oc1.ap-melbourne-1.aa"
  }

  source_details {
    #Required
    source_id = data.hcp_packer_image.tf-oci-test.cloud_image_id
    source_type = "image"
  }
}
```
Apply:
```
$ terraform apply
data.hcp_packer_image.tf-oci-test: Reading...
data.hcp_packer_image.tf-oci-test: Read complete after 0s [id=XXX]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_core_instance.test_instance will be created
  + resource "oci_core_instance" "test_instance" {
      + availability_domain                 = "XXX:AP-MELBOURNE-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.compartment.oc1..a"
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = (known after apply)
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard.E2.1.Micro"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config {
          + are_all_plugins_disabled = (known after apply)
          + is_management_disabled   = (known after apply)
          + is_monitoring_disabled   = (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      + availability_config {
          + is_live_migration_preferred = (known after apply)
          + recovery_action             = (known after apply)
        }

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = "ocid1.subnet.oc1.ap-melbourne-1.a
          + vlan_id                = (known after apply)
        }

      + instance_options {
          + are_legacy_imds_endpoints_disabled = (known after apply)
        }

      + launch_options {
          + boot_volume_type                    = (known after apply)
          + firmware                            = (known after apply)
          + is_consistent_volume_naming_enabled = (known after apply)
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + network_type                        = (known after apply)
          + remote_data_volume_type             = (known after apply)
        }

      + platform_config {
          + are_virtual_instructions_enabled               = (known after apply)
          + is_access_control_service_enabled              = (known after apply)
          + is_input_output_memory_management_unit_enabled = (known after apply)
          + is_measured_boot_enabled                       = (known after apply)
          + is_secure_boot_enabled                         = (known after apply)
          + is_symmetric_multi_threading_enabled           = (known after apply)
          + is_trusted_platform_module_enabled             = (known after apply)
          + numa_nodes_per_socket                          = (known after apply)
          + percentage_of_cores_enabled                    = (known after apply)
          + type                                           = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = (known after apply)
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = (known after apply)
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + kms_key_id              = (known after apply)
          + source_id               = "ocid1.image.oc1.ap-melbourne-1.a"
          + source_type             = "image"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

oci_core_instance.test_instance: Creating...
oci_core_instance.test_instance: Still creating... [10s elapsed]
oci_core_instance.test_instance: Still creating... [20s elapsed]
oci_core_instance.test_instance: Still creating... [30s elapsed]
oci_core_instance.test_instance: Still creating... [40s elapsed]
oci_core_instance.test_instance: Still creating... [50s elapsed]
oci_core_instance.test_instance: Creation complete after 58s [id=ocid1.instance.oc1.ap-melbourne-1.a]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
![packer2](https://user-images.githubusercontent.com/2263040/211941916-06fce135-75a4-4d7d-9cdb-9829a6eb9747.png)
![packer1](https://user-images.githubusercontent.com/2263040/211941927-fce1c52a-daaa-4296-a894-48fa3490b98a.png)
